In [69]:
import numpy as np
import pandas as pd

In [70]:
d1 = {'Name':["Raj", "Ramesh", "Mary","Sachin"], 'Age':[23,34,36,32], 'Height':[180,170,165,156]}

In [72]:
df1=pd.DataFrame(d1)
df1

     Name  Age  Height
0     Raj   23     180
1  Ramesh   34     170
2    Mary   36     165
3  Sachin   32     156

In [83]:
list1 = [1,2,3]
list2 = ['a','b','c']
zipped=zip(list1,list2)
print(list(zipped))

[(1, 'a'), (2, 'b'), (3, 'c')]